Ran Plan for 2 projects:

1. project: `develop` dir: `dev` workspace: `dev`
1. project: `stage` dir: `stage` workspace: `stage`
---

### 1. project: `develop` dir: `dev` workspace: `dev`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.this will be created
+ resource "aws_instance" "this" {
      + ami                                  = "ami-03f4878755434977f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "custome-dev-ec2"
        }
      + tags_all                             = {
          + "Name" = "custome-dev-ec2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p develop
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://f98fd876adec:4141/lock?id=vjaydevops%252Fterraform-atlantis%252Fdev%252Fdev)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p develop
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. project: `stage` dir: `stage` workspace: `stage`
<details><summary>Show Output</summary>

```diff
aws_instance.this: Refreshing state... [id=i-0a82fbe07c5f28d69]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # aws_instance.this will be updated in-place
~ resource "aws_instance" "this" {
        id                                   = "i-0a82fbe07c5f28d69"
      ~ tags                                 = {
          ~ "Name" = "$WORKSPACE-ec2" -> "stage-ec2"
        }
      ~ tags_all                             = {
          ~ "Name" = "$WORKSPACE-ec2" -> "stage-ec2"
        }
        # (38 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://f98fd876adec:4141/lock?id=vjaydevops%252Fterraform-atlantis%252Fstage%252Fstage)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p stage
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```